public class Main {
    public static void main(String[] args) {

        // Объявляете переменные для входных данных и

        System.out.println("Премиальные мили составляют:");
        int priceTicket = 1000;
        int money = 20;
        int bonus;

        System.out.println(bonus = priceTicket / money);

        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}